[M_Ep9_GetBackToSanctuary MissionDefinition]
TurnInDescription="You've linked back up with [place]Sanctuary[-place], but you and the other members of the resistance still have no plan, no leverage, and no obvious way of stopping Handsome Jack.<br><br>Hey, it's all uphill from here, right?"

[M_Ep9_GetBackToSanctuary:CrossTheWaterwaySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The good news is, you found [place]Sanctuary[-place]. The bad news is, it's floating in the air and is inaccessible by fast-travel. The Guardian Angel has asked you to head to the nearby [place]Eridium Extraction Plant[-place]. Presumably, she's got some sort of plan to get you back to your friends. Whatever Angel wants you to get is apparently across the waterway in the extraction plant. You'll have to find a way across the water."

[M_Ep9_GetBackToSanctuary:DefendBeaconSet1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="The good news is, you found [place]Sanctuary[-place]. The bad news is, it's floating in the air and is inaccessible by fast-travel. The Guardian Angel has suggested grabbing a lunar supply beacon. If you have a supply beacon, Angel says, you can summon a fast-travel station via a lunar supply request, then use that to link back up with [place]Sanctuary[-place]. Simple! Kind of. With the beacon deployed in the middle of [place]Overlook[-place], the Angel has instructed you to protect it until the supply request can complete."

[M_Ep9_GetBackToSanctuary:EstablishLink MissionObjectiveDefinition]
ProgressMessage="Establish fast-travel link"

[M_Ep9_GetBackToSanctuary:EstablishLinkSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Establish a fast-travel link with [place]Sanctuary[-place]."
MissionDescriptionOverride="The fast-travel station has arrived from the lunar base. Angel has instructed you to establish a link with [place]Sanctuary[-place] so you can get the city back on the fast-travel network."

[M_Ep9_GetBackToSanctuary:FriendsFoundSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The fast-travel station has arrived from the lunar base. Angel has instructed you to establish a link with [place]Sanctuary[-place] so you can get the city back on the fast-travel network. Lilith has asked you to return to Crimson Raiders HQ in [place]Sanctuary[-place]."

[M_Ep9_GetBackToSanctuary:GoToDamSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The good news is, you found [place]Sanctuary[-place]. The bad news is, it's floating in the air and is inaccessible by fast-travel. The Guardian Angel has asked you to head to the nearby [place]Eridium Extraction Plant[-place]. Presumably, she's got some sort of plan to get you back to your friends."

[M_Ep9_GetBackToSanctuary:GoToDeploySiteSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The good news is, you found [place]Sanctuary[-place]. The bad news is, it's floating in the air and is inaccessible by fast-travel. Now that you've got a lunar supply beacon, the Guardian Angel has directed you to the town of [place]Overlook[-place]. Once there, you can activate the beacon and request a new fast-travel station."

[M_Ep9_GetBackToSanctuary:KillTheThresherEmergeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The good news is, you found [place]Sanctuary[-place]. The bad news is, it's floating in the air and is inaccessible by fast-travel. The Guardian Angel has suggested grabbing a lunar supply beacon. If you have a supply beacon, Angel says, you can summon a fast-travel station via a lunar supply request, then use that to link back up with [place]Sanctuary[-place]. Simple! Kind of. Unfortunately, a thresher has eaten the supply beacon. Fortunately, you have a gun."

[M_Ep9_GetBackToSanctuary:KillTheThresherSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The good news is, you found [place]Sanctuary[-place]. The bad news is, it's floating in the air and is inaccessible by fast-travel. The Guardian Angel has suggested grabbing a lunar supply beacon. If you have a supply beacon, Angel says, you can summon a fast-travel station via a lunar supply request, then use that to link back up with [place]Sanctuary[-place]. Simple! Kind of. Unfortunately, a thresher has eaten the supply beacon. Fortunately, you have a gun."

[M_Ep9_GetBackToSanctuary:RetrieveBeaconSet1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="The good news is, you found [place]Sanctuary[-place]. The bad news is, it's floating in the air and is inaccessible by fast-travel. The Guardian Angel has suggested grabbing a lunar supply beacon. If you have a supply beacon, Angel says, you can summon a fast-travel station via a lunar supply request, then use that to link back up with [place]Sanctuary[-place]. Simple! Kind of."

[M_Ep9_GetBackToSanctuary:usefasttravel MissionObjectiveDefinition]
ProgressMessage="Use fast-travel station"
